#3. Задайте список из n чисел последовательности (1 + 1 / n) ** n и выведите на экран их сумму.

N = []
for i in range (1,101):
    print (N)